docs: update graph to mermaid
